; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v10 ?v9)
             (pred_9 ?v13 ?v8)
             (pred_7 ?v10 ?v8)
             (pred_6 ?v11 ?v10 )
	     (pred_12 ?v10)
             (pred_8 ?v5)
             (pred_10 ?v13)
             (pred_5 ?v8)
             (pred_1 ?v10)
             (pred_11 ?v13)
             (pred_3 ?v10)
             (pred_4 ))



(:action op_4
:parameters (?v7 ?v1 ?v4 ?v12)
:precondition (and (pred_8 ?v7) (pred_8 ?v1) (pred_10 ?v4) (pred_5 ?v12)
          (pred_2 ?v7 ?v1) (pred_9 ?v4 ?v12)
                   (pred_7 ?v1 ?v12) (pred_12 ?v7) 
                   (pred_1 ?v1) (pred_11 ?v4))
:effect (and  (pred_3 ?v1) (not (pred_1 ?v1))))


(:action op_2
:parameters (?v7 ?v2)
:precondition (and (pred_8 ?v7) (pred_8 ?v2)
               (pred_12 ?v7) (pred_2 ?v7 ?v2) (pred_3 ?v2))
:effect (and (pred_12 ?v2) (not (pred_12 ?v7))))

(:action op_3
:parameters (?v7 ?v4)
:precondition (and (pred_8 ?v7) (pred_10 ?v4) 
                  (pred_12 ?v7) (pred_6 ?v4 ?v7) (pred_4 ))
:effect (and (pred_11 ?v4)
   (not (pred_6 ?v4 ?v7)) (not (pred_4 ))))


(:action op_5
:parameters (?v7 ?v6 ?v3)
:precondition (and (pred_8 ?v7) (pred_10 ?v6) (pred_10 ?v3)
                  (pred_12 ?v7) (pred_11 ?v3) (pred_6 ?v6 ?v7))
:effect (and (pred_11 ?v6) (pred_6 ?v3 ?v7)
        (not (pred_11 ?v3)) (not (pred_6 ?v6 ?v7))))

(:action op_1
:parameters (?v7 ?v4)
:precondition (and (pred_8 ?v7) (pred_10 ?v4) 
                  (pred_12 ?v7) (pred_11 ?v4))
:effect (and (pred_4 ) (pred_6 ?v4 ?v7) (not (pred_11 ?v4)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_08 obj_12 obj_13 obj_06 obj_15 obj_19 obj_20 obj_09 obj_07 obj_02 obj_21 obj_18 obj_05 obj_03 obj_04
    obj_17 obj_11 obj_22
    obj_16 obj_10 obj_01
    )

    (:init
       (pred_4)

       (pred_8 obj_14)
       (pred_8 obj_08)
       (pred_8 obj_12)
       (pred_8 obj_13)
       (pred_8 obj_06)
       (pred_8 obj_15)
       (pred_8 obj_19)
       (pred_8 obj_20)
       (pred_8 obj_09)
       (pred_8 obj_07)
       (pred_8 obj_02)
       (pred_8 obj_21)
       (pred_8 obj_18)
       (pred_8 obj_05)
       (pred_8 obj_03)
       (pred_8 obj_04)
       (pred_5 obj_17)
       (pred_5 obj_11)
       (pred_5 obj_22)
       (pred_10 obj_16)
       (pred_10 obj_10)
       (pred_10 obj_01)

       (pred_2 obj_14 obj_06)
       (pred_2 obj_14 obj_08)
       (pred_2 obj_08 obj_15)
       (pred_2 obj_08 obj_12)
       (pred_2 obj_08 obj_14)
       (pred_2 obj_12 obj_19)
       (pred_2 obj_12 obj_13)
       (pred_2 obj_12 obj_08)
       (pred_2 obj_13 obj_20)
       (pred_2 obj_13 obj_12)
       (pred_2 obj_06 obj_09)
       (pred_2 obj_06 obj_15)
       (pred_2 obj_06 obj_14)
       (pred_2 obj_15 obj_07)
       (pred_2 obj_15 obj_19)
       (pred_2 obj_15 obj_08)
       (pred_2 obj_15 obj_06)
       (pred_2 obj_19 obj_02)
       (pred_2 obj_19 obj_20)
       (pred_2 obj_19 obj_12)
       (pred_2 obj_19 obj_15)
       (pred_2 obj_20 obj_21)
       (pred_2 obj_20 obj_13)
       (pred_2 obj_20 obj_19)
       (pred_2 obj_09 obj_18)
       (pred_2 obj_09 obj_07)
       (pred_2 obj_09 obj_06)
       (pred_2 obj_07 obj_05)
       (pred_2 obj_07 obj_02)
       (pred_2 obj_07 obj_15)
       (pred_2 obj_07 obj_09)
       (pred_2 obj_02 obj_03)
       (pred_2 obj_02 obj_21)
       (pred_2 obj_02 obj_19)
       (pred_2 obj_02 obj_07)
       (pred_2 obj_21 obj_04)
       (pred_2 obj_21 obj_20)
       (pred_2 obj_21 obj_02)
       (pred_2 obj_18 obj_05)
       (pred_2 obj_18 obj_09)
       (pred_2 obj_05 obj_03)
       (pred_2 obj_05 obj_07)
       (pred_2 obj_05 obj_18)
       (pred_2 obj_03 obj_04)
       (pred_2 obj_03 obj_02)
       (pred_2 obj_03 obj_05)
       (pred_2 obj_04 obj_21)
       (pred_2 obj_04 obj_03)
       (pred_1 obj_09)
       (pred_1 obj_12)
       (pred_1 obj_04)
       (pred_7  obj_09 obj_17)
       (pred_7  obj_12 obj_11)
       (pred_7  obj_04 obj_22)
       (pred_3 obj_14)
       (pred_3 obj_08)
       (pred_3 obj_13)
       (pred_3 obj_06)
       (pred_3 obj_15)
       (pred_3 obj_19)
       (pred_3 obj_20)
       (pred_3 obj_07)
       (pred_3 obj_02)
       (pred_3 obj_21)
       (pred_3 obj_18)
       (pred_3 obj_05)
       (pred_3 obj_03)

       (pred_9  obj_16 obj_17)
       (pred_9  obj_10 obj_11)
       (pred_9  obj_01 obj_22)
       (pred_6 obj_16 obj_06)
       (pred_6 obj_10 obj_20)
       (pred_6 obj_01 obj_03)
       (pred_12 obj_15)
    )

    (:goal (and
       (pred_6 obj_16 obj_14)
       (pred_6 obj_10 obj_18)
       (pred_6 obj_01 obj_19)
    ))
(:constraints
  (always (not (pred_12 obj_09)))
)
)

; plan
1. (op_2 obj_15 obj_06)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_06)
   goals met: 0 of 3
2. (op_3 obj_06 obj_16)
   deleted: (pred_6 obj_16 obj_06) (pred_4)
   added: (pred_11 obj_16)
   goals met: 0 of 3
3. (op_2 obj_06 obj_15)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_15)
   goals met: 0 of 3
4. (op_2 obj_15 obj_19)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_19)
   goals met: 0 of 3
5. (op_1 obj_19 obj_16)
   deleted: (pred_11 obj_16)
   added: (pred_4) (pred_6 obj_16 obj_19)
   goals met: 0 of 3
6. (op_2 obj_19 obj_20)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_20)
   goals met: 0 of 3
7. (op_3 obj_20 obj_10)
   deleted: (pred_6 obj_10 obj_20) (pred_4)
   added: (pred_11 obj_10)
   goals met: 0 of 3
8. (op_2 obj_20 obj_19)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_19)
   goals met: 0 of 3
9. (op_2 obj_19 obj_02)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_02)
   goals met: 0 of 3
10. (op_2 obj_02 obj_03)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_03)
   goals met: 0 of 3
11. (op_2 obj_03 obj_05)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_05)
   goals met: 0 of 3
12. (op_2 obj_05 obj_18)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_18)
   goals met: 0 of 3
13. (op_1 obj_18 obj_10)
   deleted: (pred_11 obj_10)
   added: (pred_4) (pred_6 obj_10 obj_18)
   goals met: 1 of 3
14. (op_2 obj_18 obj_05)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_05)
   goals met: 1 of 3
15. (op_2 obj_05 obj_03)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_03)
   goals met: 1 of 3
16. (op_3 obj_03 obj_01)
   deleted: (pred_6 obj_01 obj_03) (pred_4)
   added: (pred_11 obj_01)
   goals met: 1 of 3
17. (op_2 obj_03 obj_02)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_02)
   goals met: 1 of 3
18. (op_2 obj_02 obj_19)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_19)
   goals met: 1 of 3
19. (op_5 obj_19 obj_16 obj_01)
   deleted: (pred_11 obj_01) (pred_6 obj_16 obj_19)
   added: (pred_11 obj_16) (pred_6 obj_01 obj_19)
   goals met: 2 of 3
20. (op_2 obj_19 obj_15)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_15)
   goals met: 2 of 3
21. (op_2 obj_15 obj_08)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_08)
   goals met: 2 of 3
22. (op_2 obj_08 obj_14)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_14)
   goals met: 2 of 3
23. (op_1 obj_14 obj_16)
   deleted: (pred_11 obj_16)
   added: (pred_4) (pred_6 obj_16 obj_14)
   goals met: 3 of 3
